app/controllers/session_controller.rb

  def create
    user_params = params.require(:user)
    @user = User.where(email: user_params[:email]).first
    if @user
      if !user_params[:password]
        @user.update(password: @user.generate_token)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mrvxo@protonmail.com' ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `users`.`password` = '6e89b15fc216b854c664', `users`.`updated_at` = '2021-04-16 01:11:41.863517' WHERE `users`.`id` = 3