app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def edit
    @user = User.find(session[:auth]['id'])